var where = new Array(35);
function comefrom(loca,locacity) { this.loca = loca; this.locacity = locacity; }
where[0]= new comefrom("请选择省份名","请选择城市名");
where[1] = new comefrom("北京市","|东城区|西城区|崇文区|宣武区|朝阳区|丰台区|石景山区|海淀区|门头沟区|房山区|通州区|顺义区|昌平区|大兴区|平谷区|怀柔区|密云县|延庆县"); 
where[2] = new comefrom("上海市","|黄浦区|卢湾区|徐汇区|长宁区|静安区|普陀区|闸北区|虹口区|杨浦区|闵行区|宝山区|嘉定区|浦东区|金山区|松江区|青浦区|南汇区|奉贤区|崇明区");
where[3] = new comefrom("天津市","|和平区|东丽区|河东区|西青区|河西区|津南区|南开区|北辰区|河北区|武清区|红挢区|塘沽区|汉沽区|大港区|宁河区|静海区|宝坻区|蓟县区");
where[4] = new comefrom("重庆市","|万州区|涪陵区|渝中区|大渡口区|江北区|沙坪坝区|九龙坡区|南岸区|北碚区|万盛区|渝北区|巴南区|黔江区|长寿区|綦江区|潼南区|铜梁区|大足区|荣昌区|壁山区|梁平区|城口县|丰都县|垫江县|武隆区|忠县|开州区|云阳县|奉节县|巫山县|巫溪县|石柱县|秀山县|酉阳县|彭水县|江津区|合川区|永川区|南川区");
where[5] = new comefrom("河北省","|石家庄市|邯郸市|邢台市|保定市|张家口市|承德市|廊坊市|唐山市|秦皇岛市|沧州市|衡水市");
where[6] = new comefrom("山西省","|太原市|大同市|阳泉市|长治市|晋城市|朔州市|吕梁市|忻州市|晋中市|临汾市|运城市");
where[7] = new comefrom("内蒙古自治区","|呼和浩特市|包头市|乌海市|赤峰市|通辽市|鄂尔多斯市|呼伦贝尔市|巴彦淖尔市|乌兰察布市|兴安盟|锡林郭勒盟|阿拉善盟|伊克昭盟|哲里木盟");
where[8] = new comefrom("辽宁省","|沈阳市|大连市|鞍山市|抚顺市|本溪市|丹东市|锦州市|营口市|阜新市|辽阳市|盘锦市|铁岭市|朝阳市|葫芦岛市");
where[9] = new comefrom("吉林省","|长春市|吉林市|四平市|辽源市|通化市|白山市|松原市|白城市|延边朝鲜族自治州");
where[10] = new comefrom("黑龙江省","|哈尔滨市|齐齐哈尔市|牡丹江市|佳木斯市|大庆市|绥化市|鹤岗市|鸡西市|黑河市|双鸭山市|伊春市|七台河市|大兴安岭地区");
where[11] = new comefrom("江苏省","|南京市|镇江市|苏州市|南通市|扬州市|盐城市|徐州市|连云港市|常州市|无锡市|宿迁市|泰州市|淮安市");
where[12] = new comefrom("浙江省","|杭州市|宁波市|温州市|嘉兴市|湖州市|绍兴市|金华市|衢州市|舟山市|台州市|丽水市");
where[13] = new comefrom("安徽省","|合肥市|芜湖市|蚌埠市|马鞍山市|淮北市|铜陵市|安庆市|黄山市|滁州市|宿州市|池州市|淮南市|巢湖市|阜阳市|六安市|宣城市|亳州市");
where[14] = new comefrom("福建省","|福州市|厦门市|莆田市|三明市|泉州市|漳州市|南平市|龙岩市|宁德市");
where[15] = new comefrom("江西省","|南昌市|景德镇市|九江市|鹰潭市|萍乡市|新馀市|赣州市|吉安市|宜春市|抚州市|上饶市");
where[16] = new comefrom("山东省","|济南市|青岛市|淄博市|枣庄市|东营市|烟台市|潍坊市|济宁市|泰安市|威海市|日照市|莱芜市|临沂市|德州市|聊城市|滨州市|菏泽市");
where[17] = new comefrom("河南省","|郑州市|开封市|洛阳市|平顶山市|安阳市|鹤壁市|新乡市|焦作市|濮阳市|许昌市|漯河市|三门峡市|南阳市|商丘市|信阳市|周口市|驻马店市|济源市");
where[18] = new comefrom("湖北省","|武汉市|宜昌市|荆州市|襄樊市|黄石市|荆门市|黄冈市|十堰市|随州市|咸宁市|孝感市|鄂州市|恩施土家族苗族自治州|潜江市|天门市|仙桃市|神农架林区");
where[19] = new comefrom("湖南省","|长沙市|常德市|株洲市|湘潭市|衡阳市|岳阳市|邵阳市|益阳市|娄底市|怀化市|郴州市|永州市|张家界市|湘西土家族苗族自治州");
where[20] = new comefrom("广东省","|广州市|深圳市|珠海市|汕头市|东莞市|中山市|佛山市|韶关市|江门市|湛江市|茂名市|肇庆市|惠州市|梅州市|汕尾市|河源市|阳江市|清远市|潮州市|揭阳市|云浮市");
where[21] = new comefrom("广西壮族自治区","|南宁市|柳州市|桂林市|梧州市|北海市|防城港市|钦州市|贵港市|玉林市|南宁市|柳州市|贺州市|百色市|河池市|来宾市|崇左市");
where[22] = new comefrom("海南省","|海口市|三亚市|三沙市|五指山市|琼海市|儋州市|文昌市|万宁市|东方市|定安县|屯昌县|澄迈县|临高县|白沙黎族自治县|昌江黎族自治县|乐东黎族自治县|陵水黎族自治县|保亭黎族苗族自治县|琼中黎族苗族自治县");
where[23] = new comefrom("四川省","|成都市|绵阳市|德阳市|泸州市|自贡市|攀枝花市|广元市|内江市|遂宁市|乐山市|南充市|宜宾市|广安市|达川市|雅安市|巴中市|资阳市|眉山市|甘孜藏族自治州|凉山彝族自治州|阿坝藏族羌族自治州");
where[24] = new comefrom("贵州省","|贵阳市|六盘水市|遵义市|安顺市|铜仁市|黔西南布依族苗族自治州|毕节市|黔东南苗族侗族自治州|黔南布依族苗族自治州");
where[25] = new comefrom("云南省","|昆明市|曲靖市|玉溪市|昭通市|保山市|临沧市|普洱市|大理白族自治州|楚雄彝族自治州|红河哈尼族彝族自治州|文山壮族苗族自治州|西双版纳傣族自治州|德宏傣族景颇族自治州|丽江市|怒江傈僳族自治州|迪庆藏族自治州");
where[26] = new comefrom("西藏自治区","|拉萨市|日喀则地区|山南地区|林芝地区|昌都地区|阿里地区|那曲地区");
where[27] = new comefrom("陕西省","|西安市|宝鸡市|咸阳市|铜川市|渭南市|延安市|榆林市|汉中市|安康市|商洛市");
where[28] = new comefrom("甘肃省","|兰州市|嘉峪关市|金昌市|白银市|天水市|酒泉市|张掖市|武威市|定西市|陇南市|平凉市|庆阳市|临夏回族自治州|甘南藏族自治州");
where[29] = new comefrom("宁夏回族自治区","|银川市|石嘴山市|吴忠市|固原市|中卫市");
where[30] = new comefrom("青海省","|西宁市|海东地区|海南藏族自治州|海北藏族自治州|黄南藏族自治州|玉树藏族自治州|果洛藏族自治州|海西蒙古族藏族自治州");
where[31] = new comefrom("新疆维吾尔族自治区","|乌鲁木齐市|克拉玛依市|石河子市|阿拉尔市|图木舒克市|五家渠市|伊犁哈萨克自治州|巴音郭楞蒙古自治州|昌吉回族自治州|克孜勒苏柯尔克孜自治州|博尔塔拉蒙古自治州|吐鲁番地区|哈密地区|喀什地区|和田地区|阿克苏地区|塔城地区|阿勒泰地区");
where[32] = new comefrom("香港特别行政区","");
where[33] = new comefrom("澳门特别行政区","");
where[34] = new comefrom("台湾省","|台北市|高雄市|台中市|台南市|屏东市|南投市|云林市|新竹市|彰化市|苗栗市|嘉义市|花莲市|桃园市|宜兰市|基隆市|台东市|金门市|马祖市|澎湖市");
where[35] = new comefrom("其它","|北美洲|南美洲|亚洲|非洲|欧洲|大洋洲");
function select() {
	var loca2 =$("#province").val();
	$("#city").empty();
	for(i =0; i<where.length;i ++) {
		if (where[i].loca == loca2) {
			loca3 = (where[i].locacity).split("|");
			
			for(j = 0;j < loca3.length;j++) {
			//	 length = loca3.length;
				 provHtml = $("<option>").val(loca3[j]).text(loca3[j]);
				 $("#city").append(provHtml);
			}
			break;
		}
	}


} 
function init(pro, cityn) {
	
	var provHtml = '';
	for(k=0;k<where.length;k++)
	{
	  provHtml = $("<option>").val(where[k].loca).text(where[k].loca);
	  $("#province").append(provHtml);
	}
	var loca3 = (where[0].locacity).split("|");
	var length = loca3.length;
	provHtml = '';
	for(l=0;l<length;l++){
		provHtml = $("<option>").val(loca3[l]).text(loca3[l]);
	    $("#city").append(provHtml);
	}
	if(pro!="")
	{
		$("#province").val(pro);
		select();
		if(cityn!=""){
		    $("#city").val(cityn);
		}
	}
}

